v2206/urban_Microclimate/windAroundBuildings_CFDHAM_veg/constant/vegetation/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Write agglomeration as a volScalarField with calculated boundary values
writeFacesAgglomeration   true;
writeViewFactorMatrix   true;

//Debug option
debug                     1;

//Dump connectivity rays
dumpRays                  false;

maxDynListLength 10000000;

skyPosVector	(0 0 1);

// Per patch (wildcard possible) the coarsening level
west
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}
east
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}
north
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}
south
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}
top
{
    nFacesInCoarsestLevel     100;
    featureAngle              10;
}
ground
{
    nFacesInCoarsestLevel     1000;
    featureAngle              10;
}
buildings
{
    nFacesInCoarsestLevel     1400;
    featureAngle              10;
}
air_to_vegetation
{
    nFacesInCoarsestLevel     300;
    featureAngle              150;
}

// ************************************************************************* //
